["1","How many answers are there in page 27 Exercise 1.2.2?","9"]
["2","What is the tips number in page 78?","6"]
["3","What is the first underlined Uva question on page 25?","00403"]
["4","How many questions\/Exercises in page 47 has a '*'?","8"]
["5","How many points of 'Tips 6 Optimizing your coding' are there in page 78 and page 79?","12"]
["6","What is the first Uva question number mentioned in page 86?","11935"]
["7","In page 126,what is the content in the bracket() next to the title '4.2.5 Topological Sort'?","Direct Acyclic Graph"]
["8","What is the content of the largest title on page 133?","4.2.9 Finding Strongly Connected Component (Directed Graph)"]
["9","what is the algorithm discussed on page 155?","Floyd Warshall's Algorithm"]
["10","How many questions on page 197 without a '*' and underlines?","24"]
["11","On page 216, there are 2 largest titles, what is the content of the second one?","5.5.8 Modulo Arithmetic"]
["12","On page 248 there are 2 algorithm inventors, what is the number of citations of paper written by the second inventor in 1990?","24000"]
["13","How many triangles are there in page 279?","4"]
["14","How many circles are there from page 277 to 280?","7"]
["15","How many digrams are there on page 291?","6"]
["16","When was the photo on page 298 taken?","2007"]
["17","What is the total number of Exercises on page 311?","21"]
["18","What is the figure number on page 315? e.g X.Y","8.11"]
["19","Is there a figure on page 322? Yes\/No","No"]
["20","What is the word on the deep color ballon held by Steven at page 334?","IBM"]
["21","What is the Chinese Proverb on page 335?","Learning is a treasure that will follow its owner everywhere."]
["22","How many vertices are there in the graph on page 350?","8"]
["23","What is the content of the biggest title on page 366?","DP Speed-up with Matrix Power"]
["24","What is the figure number on page 388? e.g X.Y","9.13"]
["25","What is the sum of 3 numbers in the table on page 392?","153"]
["26","How many terms are there in the Bibliography on page 398-401?","71"]
["27","What is the largest page number of this book?","423"]
["28","What is the largest Uva number on page 421?","11984"]
["29","How many pages are there in the Content part of this book?","5"]
["30","How many distinct First Letters (e.g ABC, A is the first letter) are there in the Abbreviation of this book?","17"]
